N = int(input('Сколько чисел будем возводить в третью степень?'))
i = 1
while i <= N:
    print(i*i*i)
    i = i + 1